[
  {
    "carVIN": "5YFBURHE8JP801896",
    "trueCarID": "P223124X",
    "scrapeDate": "2023-02-24",
    "scrapeURL": "https://www.truecar.com//used-cars-for-sale/listing/5YFBURHE8JP801896/2018-toyota-corolla/",
    "listingDateDiff": "109 days ago",
    "vehicleHistUseType": "Mixed Use",
    "vehicleHistTitleStatus": "Clean",
    "vehicleHistNumOwners": 2,
    "vehicleHistAccidents": 1,
    "transmissionType": "Automatic",
    "fuelType": "Gas",
    "driveType": "FWD",
    "engineInfo": "1.8L Inline-4 Gas",
    "mileage": "88,540",
    "interiorColor": "Tan",
    "exteriorColor": "Falcon Gray Metallic",
    "style": "Sedan",
    "accidentOwnership": 1,
    "location": "Nashville, TN",
    "mileageRating": "28 cty / 36 hwy",
    "monthlyPayment": "$307/mo",
    "priceClassDiffDirection": "above",
    "priceClassDiffPct": "$908 ",
    "priceClassDiffAmt": "(4.9%) ",
    "priceClassification": "High Price",
    "allFeatures": "Power Windows ~  Power Door Locks ~ Low down payments and flexible financing options for challenged credit customers with our in house financing (buy here pay here) options! We also have additional lenders for qualified buyers and vehicles. We will find the best option for your needs!   Have confidence in your next purchase with our 3 Day Satisfaction Policy. Additional lifetime ~  unlimited mileage warranty is available on qualified vehicles. This vehicle has a Clean Title. ~ Currently located at our 3511 Nolensville Pike location. Bad Credit is OK! We have low down payments and plenty of options for you to choose from. Call us at 615-321-1234! Lot financing means we can finance anyone! Instant Approvals! We finance at the price listed unlike most dealers. With our Buy Here Pay Here option we can get you into a new ride today for a low down payment or with a trade-in. We can finance people from any area(out of state too) and we take trades(even if they aren't paid off). Call us and see how much you can save. Visit us online at www.321drive.com. We have vehicle history reports on all of our vehicles. Call us for a copy! Talk to us and let us earn your business today. Price does not include document fees ~  tax ~  title ~  or registration. Our documentation fee is $299.",
    "listPrice": "$18,499"
  }
]
